list-backend/app/controllers/items_controller.rb

    def index
        items = Item.all
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]

    def create
        list = List.find_by(id: params[:list_id])
        item = list.items.create(item_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("name", "status", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["status", "to_do"], ["list_id", 1], ["created_at", "2020-06-20 04:08:31.917929"], ["updated_at", "2020-06-20 04:08:31.917929"]]

    def update
        item = Item.find_by(id: params[:id])
        item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 133], ["LIMIT", 1]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", "doing"], ["updated_at", "2020-04-16 22:08:54.171386"], ["id", 172]]

    def destroy
        item = Item.find_by(id: params[:id])
        item.delete
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 130], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 130]]