list-backend/app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
    def index
        lists = List.all

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Work"], ["created_at", "2020-04-13 00:44:04.468407"], ["updated_at", "2020-04-13 00:44:04.468407"]]
---
    def create
        list = List.create(name: params[:name], starred: params[:starred])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def update
        list = List.find_by(id: params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 90]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 25]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 25]]
---
    def destroy
        listToDelete = List.find_by(id: params[:id])
        listToDelete.items.each { |item| item.delete }